Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<BasedOn>
				<xr:Item>Document.СчетНаОплату</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.УчетУслуг</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПересчетТЧ_Товары(Элемент)
	РаботаСДокументами.РассчитатьСумму(Элементы.ТабТовары.ТекущиеДанные);
КонецПроцедуры  

&НаКлиенте
Процедура ПересчетТЧ_Услуги(Элемент)
	РаботаСДокументами.РассчитатьСумму(Элементы.ТабУслуги.ТекущиеДанные);
КонецПроцедуры 


&НаКлиенте
Процедура ТабНоменклатураПриИзменении(Элемент)
	Объект.СуммаДокумента = 
	Объект.ТабТовары.Итог("Сумма") + Объект.ТабУслуги.Итог("Сумма");
	
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры 


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Договор = АвтозаполнениеРеквизитов.УстановитьОсновнойДоговорКонтрагента(Объект.Контрагент);
	
	ОчиститьСообщения();
	АвтозаполнениеРеквизитов.ПроверкаКонтрагента(2, Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ТабТоварыНоменклатураПриИзменении(Элемент)
	
	РаботаСДокументами.ОчиститьСтрокуТЧ(Элементы.ТабТовары.ТекущиеДанные);
	
	СтрокаТЧ = Элементы.ТабТовары.ТекущиеДанные;
	СтрокаТЧ.Цена = РаботаСЦеной.ЦенаПродажи(Объект.Дата, СтрокаТЧ.Номенклатура);
	
	СтрокаТЧ = Элементы.ТабТовары.ТекущиеДанные;
	Тов = СтрокаТЧ.Номенклатура;
	СтрокаТЧ.ЕдиницаИзмерения = РаботаСоСправочниками.ПолучитьЕИ(Тов);
	СтрокаТЧ.ВидНоменклатуры = РаботаСоСправочниками.ПолучитьВидНоменклатуры(Тов);
	
	Объект.СуммаДокумента = Объект.ТабТовары.Итог("Сумма") + Объект.ТабУслуги.Итог("Сумма");
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);

КонецПроцедуры 


&НаКлиенте
Процедура ТабУслугиНоменклатураПриИзменении(Элемент)
	
	РаботаСДокументами.ОчиститьСтрокуТЧ(Элементы.ТабУслуги.ТекущиеДанные);
	
	СтрокаТЧ = Элементы.ТабУслуги.ТекущиеДанные;
	СтрокаТЧ.Цена = РаботаСЦеной.ЦенаПродажи(Объект.Дата, СтрокаТЧ.Номенклатура);
	
	СтрокаТЧ = Элементы.ТабУслуги.ТекущиеДанные;
	Тов = СтрокаТЧ.Номенклатура;
	СтрокаТЧ.ЕдиницаИзмерения = РаботаСоСправочниками.ПолучитьЕИ(Тов);
	СтрокаТЧ.ВидНоменклатуры = РаботаСоСправочниками.ПолучитьВидНоменклатуры(Тов);
	
	Объект.СуммаДокумента = Объект.ТабТовары.Итог("Сумма") + Объект.ТабУслуги.Итог("Сумма");
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);

КонецПроцедуры


&НаКлиенте
Процедура СвернутьТЧ(Команда)
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СвернутьТЧНаСервере();
КонецПроцедуры     

&НаСервере
Процедура СвернутьТЧНаСервере()
	
	ТЗ = Объект.ТабТовары.Выгрузить();		
	//Складываем дубли 
	//ТЗ.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	//ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры", "Количество, Сумма");
	
	ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры, НаборСвойств", "Количество, Сумма");  
	
	Объект.ТабТовары.Загрузить(ТЗ);
	
	//---------------------------------------------
	
	ТЗ = Объект.ТабУслуги.Выгрузить();		
	//Складываем дубли 
	//ТЗ.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	//ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры", "Количество, Сумма");
	
	ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры, НаборСвойств", "Количество, Сумма");  
	
	Объект.ТабУслуги.Загрузить(ТЗ);
		
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабТовары(Команда)
	
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ); 
			
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ТабТовары.Очистить();
	Объект.СуммаДокумента = Объект.ТабТовары.Итог("Сумма") + Объект.ТабУслуги.Итог("Сумма");
		
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьТабУслуги(Команда)
	
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ); 
			
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ТабУслуги.Очистить();
	Объект.СуммаДокумента = Объект.ТабТовары.Итог("Сумма") + Объект.ТабУслуги.Итог("Сумма");
		
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
	
КонецПроцедуры
